# integer - изменяемый тип данных. Его литерал - целое число

# Возможные операции с integer:

#Сложение
#print(1+1)

#Вычитание
#print(2-1)

#Умножение
#print(2*2)

#Возведение в степень
#print(2**3)

#Целочисленное деление
#print(10//2)

#Деление (float)
#print(10/2)

#Остаток от деления
#print(11%2)

#Бинарный сдвиг(неопознанная ебаная хуйня)
#print(10^2)

#Результатом сравнения всегда будет bool
print(1>2)
print(1>=1)
print(1<2)
print(1<=2)
print(1==1)
#нахуя это говно нужно?
print(1!=2)
print(not 8!=8)

